; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	infrared0 - mode
	infrared3 - mode
	infrared2 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	GroundStation5 - direction
	Star0 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star6)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
	(supports instrument5 infrared2)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet7)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
	(supports instrument9 infrared2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star4)
	(supports instrument10 thermograph1)
	(supports instrument10 infrared2)
	(calibration_target instrument10 Star6)
	(supports instrument11 infrared3)
	(calibration_target instrument11 Star0)
	(calibration_target instrument11 GroundStation5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet7)
)
(:goal (and
	(pointing satellite4 GroundStation3)
	(have_image Planet7 infrared0)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 infrared3)
	(have_image Planet10 infrared2)
	(have_image Star11 thermograph1)
	(have_image Planet12 infrared0)
	(have_image Phenomenon13 infrared3)
	(have_image Phenomenon14 infrared2)
))

)

; plan
1. (turn_to satellite4 groundstation3 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 groundstation3)
   goals met: 1 of 9
2. (turn_to satellite3 groundstation5 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 groundstation5)
   goals met: 1 of 9
3. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 9
4. (calibrate satellite3 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 1 of 9
5. (turn_to satellite3 planet12 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 planet12)
   goals met: 1 of 9
6. (take_image satellite3 planet12 instrument5 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 2 of 9
7. (turn_to satellite3 planet10 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet10)
   goals met: 2 of 9
8. (take_image satellite3 planet10 instrument5 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 3 of 9
9. (turn_to satellite3 phenomenon14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon14)
   goals met: 3 of 9
10. (turn_to satellite0 groundstation3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 9
11. (take_image satellite3 phenomenon14 instrument5 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 4 of 9
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
13. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 4 of 9
14. (turn_to satellite0 phenomenon13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 9
15. (take_image satellite0 phenomenon13 instrument1 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 5 of 9
16. (turn_to satellite0 phenomenon9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 9
17. (take_image satellite0 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 6 of 9
18. (turn_to satellite3 planet7 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet7)
   goals met: 6 of 9
19. (take_image satellite3 planet7 instrument5 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 7 of 9
20. (turn_to satellite3 star11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star11)
   goals met: 7 of 9
21. (take_image satellite3 star11 instrument5 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 9
22. (turn_to satellite3 star8 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star8)
   goals met: 8 of 9
23. (take_image satellite3 star8 instrument5 infrared2)
   added: (have_image star8 infrared2)
   goals met: 9 of 9
